[
  {
    "id": "T1420",
    "name": "File and Directory Discovery",
    "description": "Adversaries may enumerate files and directories or search in specific device locations for desired information within a filesystem. Adversaries may use the information fromFile and Directory Discoveryduring automated discovery to shape follow-on behaviors, including deciding if the adversary should fully infect the target and/or attempt specific actions.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1430",
    "name": "Location Tracking",
    "description": "Adversaries may track a device’s physical location through use of standard operating system APIs via malicious or exploited applications on the compromised device.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Remote Device Management Services",
        "description": "An adversary may use access to cloud services (e.g. Google's Android Device Manager or Apple iCloud's Find my iPhone) or to an enterprise mobility management (EMM)/mobile device management (MDM) server console to track the location of mobile devices managed by the service.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "Impersonate SS7 Nodes",
        "description": "Adversaries may exploit the lack of authentication in signaling system network nodes to track the location of mobile devices by impersonating a node.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1423",
    "name": "Network Service Scanning",
    "description": "Adversaries may attempt to get a listing of services running on remote hosts, including those that may be vulnerable to remote software exploitation. Methods to acquire this information include port scans and vulnerability scans from the mobile device. This technique may take advantage of the mobile device's access to an internal enterprise network either through local connectivity or through a Virtual Private Network (VPN).",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1424",
    "name": "Process Discovery",
    "description": "Adversaries may attempt to get information about running processes on a device. Information obtained could be used to gain an understanding of common software/applications running on devices within a network. Adversaries may use the information fromProcess Discoveryduring automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1418",
    "name": "Software Discovery",
    "description": "Adversaries may attempt to get a listing of applications that are installed on a device. Adversaries may use the information fromSoftware Discoveryduring automated discovery to shape follow-on behaviors, including whether or not to fully infect the target and/or attempts specific actions.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Security Software Discovery",
        "description": "Adversaries may attempt to get a listing of security applications and configurations that are installed on a device. This may include things such as mobile security products. Adversaries may use the information fromSecurity Software Discoveryduring automated discovery to shape follow-on behaviors, including whether or not to fully infect the target and/or attempt specific actions.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1426",
    "name": "System Information Discovery",
    "description": "Adversaries may attempt to get detailed information about a device’s operating system and hardware, including versions, patches, and architecture. Adversaries may use the information fromSystem Information Discoveryduring automated discovery to shape follow-on behaviors, including whether or not to fully infects the target and/or attempts specific actions.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1422",
    "name": "System Network Configuration Discovery",
    "description": "Adversaries may look for details about the network configuration and settings, such as IP and/or MAC addresses, of devices they access or through information discovery of remote systems.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Internet Connection Discovery",
        "description": "Adversaries may check for Internet connectivity on compromised systems. This may be performed during automated discovery and can be accomplished in numerous ways such as usingadb shell netstatfor Android.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "Wi-Fi Discovery",
        "description": "Adversaries may search for information about Wi-Fi networks, such as network names and passwords, on compromised systems. Adversaries may use Wi-Fi information as part ofDiscoveryorCredential Accessactivity to support both ongoing and future campaigns.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1421",
    "name": "System Network Connections Discovery",
    "description": "Adversaries may attempt to get a listing of network connections to or from the compromised device they are currently accessing or from remote systems by querying for information over the network.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  }
]