[
  {
    "id": "T1651",
    "name": "Cloud Administration Command",
    "description": "Adversaries may abuse cloud management services to execute commands within virtual machines. Resources such as AWS Systems Manager, Azure RunCommand, and Runbooks allow users to remotely run scripts in virtual machines by leveraging installed virtual machine agents.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1059",
    "name": "Command and Scripting Interpreter",
    "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor ofUnix Shellwhile Windows installations include theWindows Command ShellandPowerShell.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "PowerShell",
        "description": "Adversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include theStart-Processcmdlet which can be used to run an executable and theInvoke-Commandcmdlet which runs a command locally or on a remote computer (though administrator permissions are required to use PowerShell to connect to remote systems).",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "AppleScript",
        "description": "Adversaries may abuse AppleScript for execution. AppleScript is a macOS scripting language designed to control applications and parts of the OS via inter-application messages called AppleEvents. These AppleEvent messages can be sent independently or easily scripted with AppleScript. These events can locate open windows, send keystrokes, and interact with almost any open application locally or remotely.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".003",
        "name": "Windows Command Shell",
        "description": "Adversaries may abuse the Windows command shell for execution. The Windows command shell (cmd) is the primary command prompt on Windows systems. The Windows command prompt can be used to control almost any aspect of a system, with various permission levels required for different subsets of commands. The command prompt can be invoked remotely viaRemote Servicessuch asSSH.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".004",
        "name": "Unix Shell",
        "description": "Adversaries may abuse Unix shell commands and scripts for execution. Unix shells are the primary command prompt on Linux, macOS, and ESXi systems, though many variations of the Unix shell exist (e.g. sh, ash, bash, zsh, etc.) depending on the specific OS or distribution. Unix shells can control every aspect of a system, with certain commands requiring elevated privileges.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".005",
        "name": "Visual Basic",
        "description": "Adversaries may abuse Visual Basic (VB) for execution. VB is a programming language created by Microsoft with interoperability with many Windows technologies such asComponent Object Modeland theNative APIthrough the Windows API. Although tagged as legacy with no planned future evolutions, VB is integrated and supported in the .NET Framework and cross-platform .NET Core.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".006",
        "name": "Python",
        "description": "Adversaries may abuse Python commands and scripts for execution. Python is a very popular scripting/programming language, with capabilities to perform many functions. Python can be executed interactively from the command-line (via thepython.exeinterpreter) or via scripts (.py) that can be written and distributed to different systems. Python code can also be compiled into binary executables.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".007",
        "name": "JavaScript",
        "description": "Adversaries may abuse various implementations of JavaScript for execution. JavaScript (JS) is a platform-independent scripting language (compiled just-in-time at runtime) commonly associated with scripts in webpages, though JS can be executed in runtime environments outside the browser.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".008",
        "name": "Network Device CLI",
        "description": "Adversaries may abuse scripting or built-in command line interpreters (CLI) on network devices to execute malicious command and payloads. The CLI is the primary means through which users and administrators interact with the device in order to view system information, modify device operations, or perform diagnostic and administrative functions. CLIs typically contain various permission levels required for different commands.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".009",
        "name": "Cloud API",
        "description": "Adversaries may abuse cloud APIs to execute malicious commands. APIs available in cloud environments provide various functionalities and are a feature-rich method for programmatic access to nearly all aspects of a tenant. These APIs may be utilized through various methods such as command line interpreters (CLIs), in-browser Cloud Shells,PowerShellmodules like Azure for PowerShell, or software developer kits (SDKs) available for languages such asPython.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".010",
        "name": "AutoHotKey & AutoIT",
        "description": "Adversaries may execute commands and perform malicious tasks using AutoIT and AutoHotKey automation scripts. AutoIT and AutoHotkey (AHK) are scripting languages that enable users to automate Windows tasks. These automation scripts can be used to perform a wide variety of actions, such as clicking on buttons, entering text, and opening and closing programs.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".011",
        "name": "Lua",
        "description": "Adversaries may abuse Lua commands and scripts for execution. Lua is a cross-platform scripting and programming language primarily designed for embedded use in applications. Lua can be executed on the command-line (through the stand-alone lua interpreter), via scripts (.lua), or from Lua-embedded programs (through thestruct lua_State).",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".012",
        "name": "Hypervisor CLI",
        "description": "Adversaries may abuse hypervisor command line interpreters (CLIs) to execute malicious commands. Hypervisor CLIs typically enable a wide variety of functionality for managing both the hypervisor itself and the guest virtual machines it hosts.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1609",
    "name": "Container Administration Command",
    "description": "Adversaries may abuse a container administration service to execute commands within a container. A container administration service such as the Docker daemon, the Kubernetes API server, or the kubelet may allow remote management of containers within an environment.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1610",
    "name": "Deploy Container",
    "description": "Adversaries may deploy a container into an environment to facilitate execution or evade defenses. In some cases, adversaries may deploy a new container to execute processes associated with a particular image or deployment, such as processes that execute or download malware. In others, an adversary may deploy a new container configured without network rules, user limitations, etc. to bypass existing defenses within the environment. In Kubernetes environments, an adversary may attempt to deploy a privileged or vulnerable container into a specific node in order toEscape to Hostand access other containers running on the node.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1675",
    "name": "ESXi Administration Command",
    "description": "Adversaries may abuse ESXi administration services to execute commands on guest machines hosted within an ESXi virtual environment. Persistent background services on ESXi-hosted VMs, such as the VMware Tools Daemon Service, allow for remote management from the ESXi server. The tools daemon service runs asvmtoolsd.exeon Windows guest operating systems,vmware-tools-daemonon macOS, andvmtoolsdon Linux.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1203",
    "name": "Exploitation for Client Execution",
    "description": "Adversaries may exploit software vulnerabilities in client applications to execute code. Vulnerabilities can exist in software due to unsecure coding practices that can lead to unanticipated behavior. Adversaries can take advantage of certain vulnerabilities through targeted exploitation for the purpose of arbitrary code execution. Oftentimes the most valuable exploits to an offensive toolkit are those that can be used to obtain code execution on a remote system because they can be used to gain access to that system. Users will expect to see files related to the applications they commonly used to do work, so they are a useful target for exploit research and development because of their high utility.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1674",
    "name": "Input Injection",
    "description": "Adversaries may simulate keystrokes on a victim’s computer by various means to perform any type of action on behalf of the user, such as launching the command interpreter using keyboard shortcuts,  typing an inline script to be executed, or interacting directly with a GUI-based application.  These actions can be preprogrammed into adversary tooling or executed through physical devices such as Human Interface Devices (HIDs).",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1559",
    "name": "Inter-Process Communication",
    "description": "Adversaries may abuse inter-process communication (IPC) mechanisms for local code or command execution. IPC is typically used by processes to share data, communicate with each other, or synchronize execution. IPC is also commonly used to avoid situations such as deadlocks, which occurs when processes are stuck in a cyclic waiting pattern.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Component Object Model",
        "description": "Adversaries may use the Windows Component Object Model (COM) for local code execution. COM is an inter-process communication (IPC) component of the native Windows application programming interface (API) that enables interaction between software objects, or executable code that implements one or more interfaces. Through COM, a client object can call methods of server objects, which are typically binary Dynamic Link Libraries (DLL) or executables (EXE). Remote COM execution is facilitated byRemote Servicessuch asDistributed Component Object Model(DCOM).",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "Dynamic Data Exchange",
        "description": "Adversaries may use Windows Dynamic Data Exchange (DDE) to execute arbitrary commands. DDE is a client-server protocol for one-time and/or continuous inter-process communication (IPC) between applications. Once a link is established, applications can autonomously exchange transactions consisting of strings, warm data links (notifications when a data item changes), hot data links (duplications of changes to a data item), and requests for command execution.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".003",
        "name": "XPC Services",
        "description": "Adversaries can provide malicious content to an XPC service daemon for local code execution. macOS uses XPC services for basic inter-process communication between various processes, such as between the XPC Service daemon and third-party application privileged helper tools. Applications can send messages to the XPC Service daemon, which runs as root, using the low-level XPC ServiceC APIor the high levelNSXPCConnection APIin order to handle tasks that require elevated privileges (such as network connections). Applications are responsible for providing the protocol definition which serves as a blueprint of the XPC services. Developers typically use XPC Services to provide applications stability and privilege separation between the application client and the daemon.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1106",
    "name": "Native API",
    "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1053",
    "name": "Scheduled Task/Job",
    "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".002",
        "name": "At",
        "description": "Adversaries may abuse theatutility to perform task scheduling for initial or recurring execution of malicious code. Theatutility exists as an executable within Windows, Linux, and macOS for scheduling tasks at a specified time and date. Although deprecated in favor ofScheduled Task'sschtasksin Windows environments, usingatrequires that the Task Scheduler service be running, and the user to be logged on as a member of the local Administrators group. In addition to explicitly running theatcommand, adversaries may also schedule a task withatby directly leveraging theWindows Management InstrumentationWin32_ScheduledJobWMI class.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".003",
        "name": "Cron",
        "description": "Adversaries may abuse thecronutility to perform task scheduling for initial or recurring execution of malicious code. Thecronutility is a time-based job scheduler for Unix-like operating systems.  Thecrontabfile contains the schedule of cron entries to be run and the specified times for execution. Anycrontabfiles are stored in operating system-specific file paths.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".005",
        "name": "Scheduled Task",
        "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code. There are multiple ways to access the Task Scheduler in Windows. Theschtasksutility can be run directly on the command line, or the Task Scheduler can be opened through the GUI within the Administrator Tools section of the Control Panel. In some cases, adversaries have used a .NET wrapper for the Windows Task Scheduler, and alternatively, adversaries have used the Windows netapi32 library andWindows Management Instrumentation(WMI) to create a scheduled task. Adversaries may also utilize the Powershell CmdletInvoke-CimMethod, which leverages WMI classPS_ScheduledTaskto create a scheduled task via an XML path.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".006",
        "name": "Systemd Timers",
        "description": "Adversaries may abuse systemd timers to perform task scheduling for initial or recurring execution of malicious code. Systemd timers are unit files with file extension.timerthat control services. Timers can be set to run on a calendar event or after a time span relative to a starting point. They can be used as an alternative toCronin Linux environments. Systemd timers may be activated remotely via thesystemctlcommand line utility, which operates overSSH.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".007",
        "name": "Container Orchestration Job",
        "description": "Adversaries may abuse task scheduling functionality provided by container orchestration tools such as Kubernetes to schedule deployment of containers configured to execute malicious code. Container orchestration jobs run these automated tasks at a specific date and time, similar to cron jobs on a Linux system. Deployments of this type can also be configured to maintain a quantity of containers over time, automating the process of maintaining persistence within a cluster.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1648",
    "name": "Serverless Execution",
    "description": "Adversaries may abuse serverless computing, integration, and automation services to execute arbitrary code in cloud environments. Many cloud providers offer a variety of serverless resources, including compute engines, application integration services, and web servers.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1129",
    "name": "Shared Modules",
    "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e.,Native API).",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1072",
    "name": "Software Deployment Tools",
    "description": "Adversaries may gain access to and use centralized software suites installed within an enterprise to execute commands and move laterally through the network. Configuration management and software deployment applications may be used in an enterprise network or cloud environment for routine administration purposes. These systems may also be integrated into CI/CD pipelines. Examples of such solutions include: SCCM, HBSS, Altiris, AWS Systems Manager, Microsoft Intune, Azure Arc, and GCP Deployment Manager.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T1569",
    "name": "System Services",
    "description": "Adversaries may abuse system services or daemons to execute commands or programs. Adversaries can execute malicious content by interacting with or creating services either locally or remotely. Many services are set to run at boot, which can aid in achieving persistence (Create or Modify System Process), but adversaries can also abuse services for one-time or temporary execution.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Launchctl",
        "description": "Adversaries may abuse launchctl to execute commands or programs. Launchctl interfaces with launchd, the service management framework for macOS. Launchctl supports taking subcommands on the command-line, interactively, or even redirected from standard input.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "Service Execution",
        "description": "Adversaries may abuse the Windows service control manager to execute malicious commands or payloads. The Windows service control manager (services.exe) is an interface to manage and manipulate services. The service control manager is accessible to users via GUI components as well as system utilities such assc.exeandNet.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".003",
        "name": "Systemctl",
        "description": "Adversaries may abuse systemctl to execute commands or programs. Systemctl is the primary interface for systemd, the Linux init system and service manager. Typically invoked from a shell, Systemctl can also be integrated into scripts or applications.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1204",
    "name": "User Execution",
    "description": "An adversary may rely upon specific actions by a user in order to gain execution. Users may be subjected to social engineering to get them to execute malicious code by, for example, opening a malicious document file or link. These user actions will typically be observed as follow-on behavior from forms ofPhishing.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": [
      {
        "id": ".001",
        "name": "Malicious Link",
        "description": "An adversary may rely upon a user clicking a malicious link in order to gain execution. Users may be subjected to social engineering to get them to click on a link that will lead to code execution. This user action will typically be observed as follow-on behavior fromSpearphishing Link. Clicking on a link may also lead to other execution techniques such as exploitation of a browser or application vulnerability viaExploitation for Client Execution. Links may also lead users to download files that require execution viaMalicious File.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".002",
        "name": "Malicious File",
        "description": "An adversary may rely upon a user opening a malicious file in order to gain execution. Users may be subjected to social engineering to get them to open a file that will lead to code execution. This user action will typically be observed as follow-on behavior fromSpearphishing Attachment. Adversaries may use several types of files that require a user to execute them, including .doc, .pdf, .xls, .rtf, .scr, .exe, .lnk, .pif, .cpl, and .reg.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".003",
        "name": "Malicious Image",
        "description": "Adversaries may rely on a user running a malicious image to facilitate execution. Amazon Web Services (AWS) Amazon Machine Images (AMIs), Google Cloud Platform (GCP) Images, and Azure Images as well as popular container runtimes such as Docker can be backdoored. Backdoored images may be uploaded to a public repository viaUpload Malware, and users may then download and deploy an instance or container from the image without realizing the image is malicious, thus bypassing techniques that specifically achieve Initial Access. This can lead to the execution of malicious code, such as code that executes cryptocurrency mining, in the instance or container.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      },
      {
        "id": ".004",
        "name": "Malicious Copy and Paste",
        "description": "An adversary may rely upon a user copying and pasting code in order to gain execution. Users may be subjected to social engineering to get them to copy and paste code directly into aCommand and Scripting Interpreter.",
        "severity": "No Test Coverage",
        "topCount": 0,
        "bottomCount": 0
      }
    ]
  },
  {
    "id": "T1047",
    "name": "Windows Management Instrumentation",
    "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.",
    "severity": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  }
]