[
  {
    "id": "T0891",
    "name": "Hardcoded Credentials",
    "description": "Adversaries may leverage credentials that are hardcoded in software or firmware to gain an unauthorized interactive user session to an asset. Examples credentials that may be hardcoded in an asset include:",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T0889",
    "name": "Modify Program",
    "description": "Adversaries may modify or add a program on a controller to affect how it interacts with the physical process, peripheral devices and other hosts on the network. Modification to controller programs can be accomplished using a Program Download in addition to other types of program modification such as online edit and program append.",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T0839",
    "name": "Module Firmware",
    "description": "Adversaries may install malicious or vulnerable firmware onto modular hardware devices. Control system devices often contain modular hardware devices. These devices may have their own set of firmware that is separate from the firmware of the main control system equipment.",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T0873",
    "name": "Project File Infection",
    "description": "Adversaries may attempt to infect project files with malicious code. These project files may consist of objects, program organization units, variables such as tags, documentation, and other configurations needed for PLC programs to function.  Using built in functions of the engineering software, adversaries may be able to download an infected program to a PLC in the operating environment enabling furtherExecutionandPersistencetechniques.",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T0857",
    "name": "System Firmware",
    "description": "System firmware on modern assets is often designed with an update feature. Older device firmware may be factory installed and require special reprograming equipment. When available, the firmware update feature enables vendors to remotely patch bugs and perform upgrades. Device firmware updates are often delegated to the user and may be done using a software update package. It may also be possible to perform this task over the network.",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  },
  {
    "id": "T0859",
    "name": "Valid Accounts",
    "description": "Adversaries may steal the credentials of a specific user or service account using credential access techniques. In some cases, default credentials for control system devices may be publicly available. Compromised credentials may be used to bypass access controls placed on various resources on hosts and within the network, and may even be used for persistent access to remote systems. Compromised and default credentials may also grant an adversary increased privilege to specific systems and devices or access to restricted areas of the network. Adversaries may choose not to use malware or tools, in conjunction with the legitimate access those credentials provide, to make it harder to detect their presence or to control devices and send legitimate commands in an unintended way.",
    "outcome": "No Test Coverage",
    "topCount": 0,
    "bottomCount": 0,
    "subtechniques": []
  }
]